app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Adding a new comment in the second post"], ["post_id", 2], ["created_at", "2016-01-24 14:10:43.934634"], ["updated_at", "2016-01-24 14:10:43.934634"]]
---
	def create
		@post = Post.find(params[:post_id])
		#@comment = @post.comments.create!(params[:comment])
		@comment = @post.comments.create!(params.require(:comment).permit!)